[
  {
    "id": "1",
    "name": "Jhon Abraham",
    "text": "My overall experience was great ! Monty was my sales guy. He worked with me to get into a nice car that I've been wanting for an extended period of time. I bought the service warranty contract with the vehicle. Had a mishaps with the warranty company after a year and a half but the manager and the service department has been nothing but great help",
    "rating": "4",
    "img": "https://randomuser.me/api/portraits/men/43.jpg"
  },

  {
    "id": "2",
    "name": "Paul M. Blevins",
    "text": "These guys was awesome to work with, aren't pushy at all and felt like talking to a friend. I was able to get my wife a wonderful quality used car for a excellent price! I highly recommend That Car Place! For the best experience see Diya! ",
    "rating": "4",
    "img": "https://randomuser.me/api/portraits/men/85.jpg"
  },

  {
    "id": "3",
    "name": "William Richard",
    "text": "Monty was a great salesperson. He stayed after hours so I could get there to make the deal. I drove 4 hours to purchase a vehicle here and he had everything ready as soon as I got there. The truck I purchased is working perfectly for my business.",
    "rating": "4",
    "img": "https://randomuser.me/api/portraits/men/31.jpg"
  },


  {
    "id": "4",
    "name": "Robert William",
    "text": "Very nice car dealership, very nice people, easy to work with, relaxed atmosphere and I did not feel pressured to buy anything. Cory was great. He was very personable and friendly and made my buying experience enjoyable. Highly recommend That Car Place.",
    "rating": "4",
    "img": "https://randomuser.me/api/portraits/men/75.jpg"
  },

  {
    "id": "5",
    "name": "Mark C. Franco",
    "text": "We absolutely LOVE Best Deals! Our salesman made the process so simple and didn’t pressure us at all to buy anything like most dealerships. Thank you for helping us get a very nice car for an affordable price. Definitely will be coming back for our next car!",
    "rating": "4",
    "img": "https://randomuser.me/api/portraits/men/73.jpg"
  },

  {
    "id": "6",
    "name": "Robin J. Badger",
    "text": "I replaced my old Caddy for a new one. not only did Carvago.com make it easier for me to buy a new car, but they also bought the old one. I can only recommend.",
    "rating": "4",
    "img": "https://randomuser.me/api/portraits/men/11.jpg"
  }
  
]
